crossref/scenarios/wssec_wrong_username.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken><wsse:Username>bob</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">0NCKf1qtLSP6NW9ow1q3Mk71TR8=</wsse:Password><wsse:Nonce>AAAAAAAAAAAAAAAAAAAAAA==</wsse:Nonce><wsu:Created>2020-01-01T00:00:00.000Z</wsu:Created></wsse:UsernameToken></wsse:Security></env:Header><env:Body><c:Echo xmlns:c="http://crossref.example/controlled"><c:Text>wrong_username</c:Text></c:Echo></env:Body></env:Envelope>
