crossref/scenarios/ns_on_header.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:c="http://crossref.example/controlled"/><env:Body><c:Echo xmlns:c="http://crossref.example/controlled"><c:Text>ns_on_header</c:Text></c:Echo></env:Body></env:Envelope>
