crossref/scenarios/ns_on_nested_payload.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><c:Echo xmlns:c="http://crossref.example/controlled"><c:Text xmlns:c="http://crossref.example/controlled">ns_on_nested_payload</c:Text></c:Echo></env:Body></env:Envelope>
